title = 'Палиндаты'
hint = 'Найти все даты-палиндромы<br>в промежутке лет:'
eg = 'Например: с 1900 по 2100'
count_btn = 'Посчитать'
years = ('С', 'ГГГГ', 'по')
error = 'Ошибка'
error_none = 'Введите год!'
error_big_small = 'Первый год должен быть больше второго!'
range_ = ('Все даты-палиндромы с\n', ' по ', ' года:')
count_res = ('Всего: ', ' даты-палиндрома', 'Нет дат-палиндромов')
back_btn = 'Выбрать новый промежуток'
help_title = 'Что такое даты-палиндромы?'
help_desc = 'Если записать все цифры даты 10 января 1001 года подряд, '\
'получится число 10011001, которое читается одинаково слева направо '\
'и справа налево. Такие числа называются палиндромами.'
dates_not_found = 'Даты-палиндромы не найдены!'
result = 'Результат'